{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "96", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "96", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "96", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice1", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum0", 
      "inputs": [[4, 0, 0], [4, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_r_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "96"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_r_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "96"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_r", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "96"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice2_r", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum1", 
      "inputs": [[10, 0, 0], [10, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice2", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum2", 
      "inputs": [[15, 0, 0], [15, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_r_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "192"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_r_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "192"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_r", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "192"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice3_r", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum3", 
      "inputs": [[21, 0, 0], [21, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice3", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum4", 
      "inputs": [[26, 0, 0], [26, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_r_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "384"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_r_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "384"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_r", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "384"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice4_r", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum5", 
      "inputs": [[32, 0, 0], [32, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice4", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum6", 
      "inputs": [[37, 0, 0], [37, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_r_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_r_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_r", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice5_r", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum7", 
      "inputs": [[43, 0, 0], [43, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice5", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum8", 
      "inputs": [[48, 0, 0], [48, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool5", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pool4_fuse_1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "pool4_fuse_1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "pool4_fuse_1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "pool4_fuse_1_slice", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum12", 
      "inputs": [[55, 0, 0], [55, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4_fuse", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pool3_fuse_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "pool3_fuse_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "pool3_fuse_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[28, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "pool3_fuse_1_slice", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum11", 
      "inputs": [[61, 0, 0], [61, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3_fuse", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[57, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pool2_fuse_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "pool2_fuse_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "pool2_fuse_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[17, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "pool2_fuse_1_slice", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum9", 
      "inputs": [[68, 0, 0], [68, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "pool2_fuse_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "pool2_fuse_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "pool2_fuse_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "pool2_fuse_2_slice", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum10", 
      "inputs": [[73, 0, 0], [73, 1, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_fuse", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[64, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[51, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attrs": {"num_hidden": "512"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attrs": {"num_hidden": "512"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attrs": {"num_hidden": "512"}, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice_fc1", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "_maximum", 
      "name": "_maximum13", 
      "inputs": [[82, 0, 0], [82, 1, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "drop1", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attrs": {"num_hidden": "40"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attrs": {"num_hidden": "40"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attrs": {"num_hidden": "40"}, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    7, 
    8, 
    12, 
    13, 
    18, 
    19, 
    23, 
    24, 
    29, 
    30, 
    34, 
    35, 
    40, 
    41, 
    45, 
    46, 
    52, 
    53, 
    58, 
    59, 
    65, 
    66, 
    70, 
    71, 
    79, 
    80, 
    85, 
    86
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    17, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    26, 
    27, 
    28, 
    29, 
    30, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    39, 
    40, 
    41, 
    42, 
    43, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    52, 
    53, 
    54, 
    55, 
    56, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    81, 
    82, 
    83, 
    84, 
    85, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    97, 
    98, 
    100, 
    101, 
    102, 
    103
  ], 
  "heads": [[87, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10301]}
}